package day15.homework;

public class HomeworkMain {
<<<<<<< HEAD
	public static void main(String[] args) {
		/* 영어 단어장을 관리하는 프로그램을 작성하세요.
		 * 기한은 1/5까지 github에 업로드 후 강사에게 공유(단톡방)
		 * - 한 단어에 뜻이 여러개 있을 수 있음
		 * - 단어, 품사, 뜻을 관리
		 * - 단어 추가
		 * - 단어 수정
		 * - 단어 삭제
		 * - 뜻 추가
		 * - 뜻 수정
		 * - 뜻 삭제
		 * - 단어 조회
		 * 
		 * - 기타 추가 기능을 구현해도 됨
		 * - 등록된 단어장에서 랜덤으로 문제가 나오고 맞추는 기능
		 * - 오답 노트를 관리하는 기능 
		 * - 많이 조회한 단어를 확인하는 기능
		 * */
		/*추가 기능없음 int num을 통해 해당 단어와 뜻으로 구분함
		 *num 1이면 단어, 0이면 뜻
		 */
		HomeworkProgram hw=new HomeworkProgram();
		hw.run();
	}

}

=======
	/* 영어 단어장을 관리하는 프로그램을 작성하세요.
	 *--------기본기능----------------
	 * - 한 단어에 뜻이 여러개 있을 수 있음
	 * - 단어, 품사, 뜻을 관리
	 * - 단어 추가
	 * - 단어 수정
	 * - 단어 삭제
	 * - 의미(뜻) 추가
	 * - 뜻 수정
	 * - 뜻 삭제
	 * - 단어조회
	 * -------------추가기능------------
	 * - 기타 추가 기능 구현 해도됨
	 * - 예) 등록된 단어장에서 랜덤으로 문제가 나오고 맞추는 기능
	 * - 오답 노트를 관리해주는 기능
	 * - 많이 조회한 단어를 확인하는 기능
	 * 
	 * 기간 1월5일까지 gitgub에 업로드후 강사에게 공유(단톡방)
	 */
	public static void main(String[] args) {
		HomeworkProgram program = new HomeworkProgram();
		program.run();
	}

}
>>>>>>> e79d8a860772b264d83e73290b95a1f1492e428b
