package day09.board;

import java.util.Scanner;

public class boardName {

	public static void main(String[] args) {
		/* 게시판에서 게시글 관리를 위한 콘솔 프로그램을 작성하세요
		 * - 제한 사항 정리 
		 * 
		 * 1. 필요한 기능을 정라해서 메뉴로 출력
		 * -- 아이디 작성 --
		 * 닉네임을(아이디) 적어주세요 : 
		 * 
		 * -- 게시판 선택 --
		 * 1. 축구
		 * 2. 농구
		 * 3. 야구
		 * 4. 배구
		 * 
		 * -- 게시판 --
		 * 1. 게시글 작성
		 * 2. 게시글 수정
		 * 3. 게시글 삭제
		 * 4. 프로그램 종료
		 * 선택 : 1
		 * 
		 * -- 게시글 작성 --
		 * 축구에 대한 게시글을 작성해주세요
		 * 제목 : 안정환
		 * 본문 : 차두리
		 * 1. 저장
		 * 2. 나가기
		 * 
		 * -- 게시판 --
		 * 1. 게시글 작성
		 * 2. 게시글 수정
		 * 3. 게시글 삭제
		 * 4. 프로그램 종료
		 * 선택 : 2
		 * 
		 * -- 게시글 수정 --
		 * 수정할 게시글 정보를 선택하세요
		 * 1. 안정환
		 * 2. ...
		 * 3. ...
		 * 선택 : 1
		 * 
		 * -- 게시글 작성 --
		 * 축구에 대한 게시글을 작성해주세요
		 * 제목 : 안정환
		 * 본문 : 차두리
		 * 1. 저장
		 * 2. 나가기
		 * 2. 기능을 구현
		 * */
		
		// 게시판 선택
			// 
		// 
		Scanner scan = new Scanner(System.in);
		System.out.print("아이디(닉네임)작성해주세요 : ");

	}

}
